xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_adc.h
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN22, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_22_INJ          ((LL_ADC_CHANNEL_22 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN22, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_22_REG_INJ      ((LL_ADC_CHANNEL_22 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN22, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_23_REG          ((LL_ADC_CHANNEL_23 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN23, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_23_INJ          ((LL_ADC_CHANNEL_23 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN23, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_23_REG_INJ      ((LL_ADC_CHANNEL_23 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN23, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_24_REG          ((LL_ADC_CHANNEL_24 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN24, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_24_INJ          ((LL_ADC_CHANNEL_24 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN24, converted by group only */
#define LL_ADC_AWD_CHANNEL_24_REG_INJ      ((LL_ADC_CHANNEL_24 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN24, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_25_REG          ((LL_ADC_CHANNEL_25 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN25, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_25_INJ          ((LL_ADC_CHANNEL_25 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN25, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_25_REG_INJ      ((LL_ADC_CHANNEL_25 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN25, converted by either group
                                           regular or injected */
#define LL_ADC_AWD_CHANNEL_26_REG          ((LL_ADC_CHANNEL_26 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN26, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_26_INJ          ((LL_ADC_CHANNEL_26 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN26, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_26_REG_INJ      ((LL_ADC_CHANNEL_26 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN26, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_27_REG          ((LL_ADC_CHANNEL_27 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN27, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_27_INJ          ((LL_ADC_CHANNEL_27 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN27, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_27_REG_INJ      ((LL_ADC_CHANNEL_27 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN27, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_28_REG          ((LL_ADC_CHANNEL_28 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN28, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_28_INJ          ((LL_ADC_CHANNEL_28 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN28, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_28_REG_INJ      ((LL_ADC_CHANNEL_28 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN28, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_29_REG          ((LL_ADC_CHANNEL_29 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN29, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_29_INJ          ((LL_ADC_CHANNEL_29 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN29, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_29_REG_INJ      ((LL_ADC_CHANNEL_29 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN29, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_30_REG          ((LL_ADC_CHANNEL_30 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN30, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_30_INJ          ((LL_ADC_CHANNEL_30 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN30, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_30_REG_INJ      ((LL_ADC_CHANNEL_30 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN30, converted by either group regular or injected */                                           
#define LL_ADC_AWD_CHANNEL_31_REG          ((LL_ADC_CHANNEL_31 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN31, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_31_INJ          ((LL_ADC_CHANNEL_31 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN31, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_31_REG_INJ      ((LL_ADC_CHANNEL_31 & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN31, converted by either group regular or injected */



#define LL_ADC_AWD_CH_TEMPSENSOR_REG       ((LL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to dac1vin ,converted by group regular only */
#define LL_ADC_AWD_CH_TEMPSENSOR_INJ       ((LL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to dac1vin ,converted by group injected only */
#define LL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   ((LL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to dac2vin, converted by either group regular or injected */
#define LL_ADC_AWD_CH_VREFINT_REG          ((LL_ADC_CHANNEL_VREFINT & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to dac2vin ,converted by group regular only */
#define LL_ADC_AWD_CH_VREFINT_INJ          ((LL_ADC_CHANNEL_VREFINT & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to dac2vin ,converted by group injected only */
#define LL_ADC_AWD_CH_VREFINT_REG_INJ      ((LL_ADC_CHANNEL_VREFINT & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to dac1vin, converted by either group regular or injected */
#define LL_ADC_AWD_CH_VBAT_REG             ((LL_ADC_CHANNEL_VBAT & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal
                                           voltage reference, converted by group regular only */
#define LL_ADC_AWD_CH_VBAT_INJ             ((LL_ADC_CHANNEL_VBAT & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal
                                           voltage reference, converted by group injected only */
#define LL_ADC_AWD_CH_VBAT_REG_INJ         ((LL_ADC_CHANNEL_VBAT & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal
                                           voltage reference, converted by either group regular or injected */
#define LL_ADC_AWD_CH_DAC_REG              ((LL_ADC_CHANNEL_DAC & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to OPA3 ,converted by group regular only */
#define LL_ADC_AWD_CH_DAC_INJ              ((LL_ADC_CHANNEL_DAC & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to OPA3 ,converted by group injected only */
#define LL_ADC_AWD_CH_DAC_REG_INJ          ((LL_ADC_CHANNEL_DAC & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to OPA3, converted by either group regular or injected */
#define LL_ADC_AWD_CH_OPA_REG              ((LL_ADC_CHANNEL_OPA & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWDEN | ADC_CFGR_AWDSGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VBAT ,converted by group regular only */
#define LL_ADC_AWD_CH_OPA_INJ              ((LL_ADC_CHANNEL_OPA & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VBAT ,converted by group injected only */
#define LL_ADC_AWD_CH_OPA_REG_INJ          ((LL_ADC_CHANNEL_OPA & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWDEN | ADC_CFGR_AWDEN \
                                            | ADC_CFGR_AWDSGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VBAT, converted by either group regular or injected */

/**
  * @}
  */

/** @defgroup ADC_LL_EC_AWD_THRESHOLDS  Analog watchdog - Thresholds
  * @{
  */
#define LL_ADC_AWD_THRESHOLD_HIGH          (ADC_TR_HT)      /*!< ADC analog watchdog threshold high */
#define LL_ADC_AWD_THRESHOLD_LOW           (ADC_TR_LT)      /*!< ADC analog watchdog threshold low */
#define LL_ADC_AWD_THRESHOLDS_HIGH_LOW     (ADC_TR_HT \
                                            | ADC_TR_LT)     /*!< ADC analog watchdog both thresholds high and low
                                           concatenated into the same data */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OVS_SCOPE  Oversampling - Oversampling scope
  * @{
  */
#define LL_ADC_OVS_DISABLE                 (0x00000000UL)                      /*!< ADC oversampling disabled. */
#define LL_ADC_OVS_GRP_REGULAR_CONTINUED   (ADC_CFGR2_ROVSE)                   /*!< ADC oversampling on conversions of
                                           ADC group regular. If group injected interrupts group regular:
                                           when ADC group injected is triggered, the oversampling on ADC group regular
                                           is temporary stopped and continued afterwards. */
#define LL_ADC_OVS_GRP_REGULAR_RESUMED     (ADC_CFGR2_ROVSM | ADC_CFGR2_ROVSE) /*!< ADC oversampling on conversions of
                                           ADC group regular. If group injected interrupts group regular:
                                           when ADC group injected is triggered, the oversampling on ADC group regular
                                           is resumed from start (oversampler buffer reset). */
#define LL_ADC_OVS_GRP_INJECTED            (ADC_CFGR2_JOVSE)                   /*!< ADC oversampling on conversions of
                                           ADC group injected. */
#define LL_ADC_OVS_GRP_INJ_REG_RESUMED     (ADC_CFGR2_JOVSE | ADC_CFGR2_ROVSE) /*!< ADC oversampling on conversions of
                                           both ADC groups regular and injected. If group injected interrupting group
                                           regular: when ADC group injected is triggered, the oversampling on ADC group
                                           regular is resumed from start (oversampler buffer reset). */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OVS_DISCONT_MODE  Oversampling - Discontinuous mode
  * @{
  */
#define LL_ADC_OVS_REG_CONT                (0x00000000UL)     /*!< ADC oversampling discontinuous mode: continuous mode
(all conversions of oversampling ratio are done from 1 trigger) */
#define LL_ADC_OVS_REG_DISCONT             (ADC_CFGR2_TROVS)  /*!< ADC oversampling discontinuous mode: discontinuous
                                           mode (each conversion of oversampling ratio needs a trigger) */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_OVS_RATIO  Oversampling - Ratio
  * @{
  */
#define LL_ADC_OVS_RATIO_2                 (0x00000000UL)                        /*!< ADC oversampling ratio of 2
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_4                 (ADC_CFGR2_OVSR_0)                    /*!< ADC oversampling ratio of 4
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_8                 (ADC_CFGR2_OVSR_1)                    /*!< ADC oversampling ratio of 8
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_16                (ADC_CFGR2_OVSR_1 | ADC_CFGR2_OVSR_0) /*!< ADC oversampling ratio of 16
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_32                (ADC_CFGR2_OVSR_2)                    /*!< ADC oversampling ratio of 32
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_64                (ADC_CFGR2_OVSR_2 | ADC_CFGR2_OVSR_0) /*!< ADC oversampling ratio of 64
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_128               (ADC_CFGR2_OVSR_2 | ADC_CFGR2_OVSR_1) /*!< ADC oversampling ratio of 128
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
#define LL_ADC_OVS_RATIO_256               (ADC_CFGR2_OVSR_2 | ADC_CFGR2_OVSR_1 \
                                            | ADC_CFGR2_OVSR_0)                   /*!< ADC oversampling ratio of 256
                                           (sum of conversions data computed to result as oversampling conversion data
                                           (before potential shift) */
/**
  * @}
  */

