xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_adc.h
/**
  * @brief  Set ADC analog watchdog monitored channels:
  *         a single channel, multiple channels or all channels,
  *         on ADC groups regular and-or injected.
  * @note   Once monitored channels are selected, analog watchdog
  *         is enabled.
  * @note   In case of need to define a single channel to monitor
  *         with analog watchdog from sequencer channel definition,
  *         use helper macro @ref __LL_ADC_ANALOGWD_CHANNEL_GROUP().
  * @note   On this chip series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion on going
  *         on either groups regular or injected.
  * @rmtoll CFGR     AWDCH         LL_ADC_SetAnalogWDMonitChannels\n
  *         CFGR     AWDSGL        LL_ADC_SetAnalogWDMonitChannels\n
  *         CFGR     AWDEN         LL_ADC_SetAnalogWDMonitChannels\n
  *         CFGR     JAWDEN        LL_ADC_SetAnalogWDMonitChannels
  * @param  ADCx ADC instance
  * @param  AWDChannelGroup This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_DISABLE
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG        
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_INJ        
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG_INJ
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG          
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_INJ          
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG_INJ
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG          
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_INJ          
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG_INJ
  *         @arg @ref LL_ADC_AWD_CH_VBAT_REG             
  *         @arg @ref LL_ADC_AWD_CH_VBAT_INJ             
  *         @arg @ref LL_ADC_AWD_CH_VBAT_REG_INJ         
  *         @arg @ref LL_ADC_AWD_CH_OPA_REG             
  *         @arg @ref LL_ADC_AWD_CH_OPA_INJ             
  *         @arg @ref LL_ADC_AWD_CH_OPA_REG_INJ         
  *         @arg @ref LL_ADC_AWD_CH_DAC_REG             
  *         @arg @ref LL_ADC_AWD_CH_DAC_INJ             
  *         @arg @ref LL_ADC_AWD_CH_DAC_REG_INJ 
  *             On this chip series, all ADCx are not available on all devices. Refer to device datasheet
  *             for more details.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDMonitChannels(ADC_TypeDef *ADCx, uint32_t AWDChannelGroup)
{
  MODIFY_REG(ADCx->CFGR,
             (ADC_CFGR_AWDEN | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL | ADC_CFGR_AWDCH),
             AWDChannelGroup);
}

/**
  * @brief  Get ADC analog watchdog monitored channel.
  * @note   Usage of the returned channel number:
  *         - To reinject this channel into another function LL_ADC_xxx:
  *           the returned channel number is only partly formatted on definition
  *           of literals LL_ADC_CHANNEL_x. Therefore, it has to be compared
  *           with parts of literals LL_ADC_CHANNEL_x or using
  *           helper macro @ref __LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Then the selected literal LL_ADC_CHANNEL_x can be used
  *           as parameter for another function.
  *         - To get the channel number in decimal format:
  *           process the returned value with the helper macro
  *           @ref __LL_ADC_CHANNEL_TO_DECIMAL_NB().
  *           Applicable only when the analog watchdog is set to monitor
  *           one channel.
  * @note   On this chip series, there are 2 kinds of analog watchdog
  *         instance:
  *         - AWD standard (instance AWD1):
  *           - channels monitored: can monitor 1 channel or all channels.
  *           - groups monitored: ADC groups regular and-or injected.
  *           - resolution: resolution is not limited (corresponds to
  *             ADC resolution configured).
  * @note   On this chip series, setting of this feature is conditioned to
  *         ADC state:
  *         ADC must be disabled or enabled without conversion on going
  *         on either groups regular or injected.
  * @rmtoll CFGR     AWDCH         LL_ADC_GetAnalogWDMonitChannels\n
  *         CFGR     AWDSGL        LL_ADC_GetAnalogWDMonitChannels\n
  *         CFGR     AWDEN         LL_ADC_GetAnalogWDMonitChannels\n
  *         CFGR     JAWDEN        LL_ADC_GetAnalogWDMonitChannels
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_AWD_DISABLE
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG        
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_INJ        
  *         @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_0_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_1_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_2_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_3_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_4_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_5_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_6_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_7_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_8_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG           
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_INJ           
  *         @arg @ref LL_ADC_AWD_CHANNEL_9_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_10_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_11_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_12_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_13_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_14_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_15_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_16_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_17_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_18_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_19_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_20_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_21_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_22_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_23_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_24_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_25_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_26_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_27_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_28_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_29_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_30_REG_INJ
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG          
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_INJ          
  *         @arg @ref LL_ADC_AWD_CHANNEL_31_REG_INJ
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG          
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_INJ          
  *         @arg @ref LL_ADC_AWD_CH_VREFINT_REG_INJ
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG          
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_INJ          
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR_REG_INJ
  *         @arg @ref LL_ADC_AWD_CH_VBAT_REG             
  *         @arg @ref LL_ADC_AWD_CH_VBAT_INJ             
  *         @arg @ref LL_ADC_AWD_CH_VBAT_REG_INJ         
  *         @arg @ref LL_ADC_AWD_CH_OPA_REG             
  *         @arg @ref LL_ADC_AWD_CH_OPA_INJ             
  *         @arg @ref LL_ADC_AWD_CH_OPA_REG_INJ         
  *         @arg @ref LL_ADC_AWD_CH_DAC_REG             
  *         @arg @ref LL_ADC_AWD_CH_DAC_INJ             
  *         @arg @ref LL_ADC_AWD_CH_DAC_REG_INJ 
  *             On this chip series, all ADCx are not available on all devices. Refer to device datasheet
  *             for more details.
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDMonitChannels(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CFGR,
                    (ADC_CFGR_AWDEN | ADC_CFGR_JAWDEN | ADC_CFGR_AWDSGL | ADC_CFGR_AWDCH)));
}

/**
  * @brief  Set ADC analog watchdog thresholds value of both thresholds
  *         high and low.
  * @note   If value of only one threshold high or low must be set,
  *         use function @ref LL_ADC_SetAnalogWDThresholds().
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __LL_ADC_ANALOGWD_SET_THRESHOLD_RESOLUTION().
  * @note   If ADC oversampling is enabled, ADC analog watchdog thresholds are
  *         impacted: the comparison of analog watchdog thresholds is done on
  *         oversampling final computation (after ratio and shift application):
  *         ADC data register bitfield [15:4] (12 most significant bits).
  *         Examples:
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 12 bits (ratio 16 and shift 4, or ratio 32 and shift 5, ...):
  *           ADC analog watchdog thresholds must be divided by 16.
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 14 bits (ratio 16 and shift 2, or ratio 32 and shift 3, ...):
  *           ADC analog watchdog thresholds must be divided by 4.
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 16 bits (ratio 16 and shift none, or ratio 32 and shift 1, ...):
  *           ADC analog watchdog thresholds match directly to ADC data register.
  * @rmtoll TR      HT            LL_ADC_ConfigAnalogWDThresholds
  *         TR      LT            LL_ADC_ConfigAnalogWDThresholds
  * @param  ADCx ADC instance
  * @param  AWDThresholdHighValue Value between Min_Data=0x000 and Max_Data=0xFFF
  * @param  AWDThresholdLowValue Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ConfigAnalogWDThresholds(ADC_TypeDef *ADCx, uint32_t AWDThresholdHighValue,
                                                     uint32_t AWDThresholdLowValue)
{
  MODIFY_REG(ADCx->TR,
             ADC_TR_HT | ADC_TR_LT,
             (AWDThresholdHighValue << ADC_TR_HT_BITOFFSET_POS) | AWDThresholdLowValue);
}

/**
  * @brief  Set ADC analog watchdog threshold value of threshold
  *         high or low.
  * @note   If values of both thresholds high or low must be set,
  *         use function @ref LL_ADC_ConfigAnalogWDThresholds().
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __LL_ADC_ANALOGWD_SET_THRESHOLD_RESOLUTION().
  * @note   If ADC oversampling is enabled, ADC analog watchdog thresholds are
  *         impacted: the comparison of analog watchdog thresholds is done on
  *         oversampling final computation (after ratio and shift application):
  *         ADC data register bitfield [15:4] (12 most significant bits).
  *         Examples:
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 12 bits (ratio 16 and shift 4, or ratio 32 and shift 5, ...):
  *           ADC analog watchdog thresholds must be divided by 16.
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 14 bits (ratio 16 and shift 2, or ratio 32 and shift 3, ...):
  *           ADC analog watchdog thresholds must be divided by 4.
  *         - Oversampling ratio and shift selected to have ADC conversion data
  *           on 16 bits (ratio 16 and shift none, or ratio 32 and shift 1, ...):
  *           ADC analog watchdog thresholds match directly to ADC data register.
  * @note   On this chip series, setting of this feature is not conditioned to
  *         ADC state:
  *         ADC can be disabled, enabled with or without conversion on going
  *         on either ADC groups regular or injected.
  * @rmtoll TR      HT            LL_ADC_SetAnalogWDThresholds
  *         TR      LT            LL_ADC_SetAnalogWDThresholds
  * @param  ADCx ADC instance
  * @param  AWDThresholdsHighLow This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref LL_ADC_AWD_THRESHOLD_LOW
  * @param  AWDThresholdValue Value between Min_Data=0x000 and Max_Data=0xFFF
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDThresholds(ADC_TypeDef *ADCx, uint32_t AWDThresholdsHighLow,
                                                  uint32_t AWDThresholdValue)
{
  MODIFY_REG(ADCx->TR,
             AWDThresholdsHighLow,
             AWDThresholdValue << ((AWDThresholdsHighLow & ADC_AWD_TRX_BIT_HIGH_MASK) >> ADC_AWD_TRX_BIT_HIGH_SHIFT4));
}

/**
  * @brief  Get ADC analog watchdog threshold value of threshold high,
  *         threshold low or raw data with ADC thresholds high and low
  *         concatenated.
  * @note   If raw data with ADC thresholds high and low is retrieved,
  *         the data of each threshold high or low can be isolated
  *         using helper macro:
  *         @ref __LL_ADC_ANALOGWD_THRESHOLDS_HIGH_LOW().
  * @note   In case of ADC resolution different of 12 bits,
  *         analog watchdog thresholds data require a specific shift.
  *         Use helper macro @ref __LL_ADC_ANALOGWD_GET_THRESHOLD_RESOLUTION().
  * @rmtoll TR      HT            LL_ADC_GetAnalogWDThresholds\n
  *         TR      LT            LL_ADC_GetAnalogWDThresholds
  * @param  ADCx ADC instance
  * @param  AWDThresholdsHighLow This parameter can be one of the following values:
  *         @arg @ref LL_ADC_AWD_THRESHOLD_HIGH
  *         @arg @ref LL_ADC_AWD_THRESHOLD_LOW
  *         @arg @ref LL_ADC_AWD_THRESHOLDS_HIGH_LOW
  * @retval Value between Min_Data=0x000 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDThresholds(const ADC_TypeDef *ADCx,
                                                      uint32_t AWDThresholdsHighLow)
{
  return (uint32_t)(READ_BIT(ADCx->TR,
                             (AWDThresholdsHighLow | ADC_TR_LT))
                    >> (((AWDThresholdsHighLow & ADC_AWD_TRX_BIT_HIGH_MASK) >> ADC_AWD_TRX_BIT_HIGH_SHIFT4)
                        & ~(AWDThresholdsHighLow & ADC_TR_LT)));
}

/**
  * @}
  */

